[
  {
    "weatherId": 200,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Thunder and tea - one wakes you up, the other keeps you sane.",
          "A gentle drizzle with dramatic sound effects. Good morning.",
          "Lightning before breakfast - how very theatrical.",
          "Just a bit of thunder to go with your toast. Lovely."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Light rain with a side of thunder - perfect picnic weather.",
          "The sky's throwing a tantrum again. Stay dry out there.",
          "Rain's light, thunder's loud - typical British balance.",
          "Sun? No. Storm? Absolutely. Pop the kettle on."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "An evening rumble to set the mood - nature's drumroll.",
          "Out for dinner? Take your brolly and your bravery.",
          "Thunderstorms and light rain - ideal for staying in.",
          "The sky's having a sulk. Best admire it from indoors."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Thunder at night - perfect for those who weren't planning to sleep anyway.",
          "Drizzle and distant rumbles - your lullaby this evening.",
          "Rain tapping the window, thunder in the distance - cosy chaos.",
          "The storm's turned nocturnal - how considerate."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Thunderstorms with light rain - drama without commitment.",
          "It's raining and rumbling - Britain's favourite combo.",
          "A bit of zap, a bit of drizzle - the weather's in a mood.",
          "Bring a brolly, wear a grin - and pretend it's fine."
        ]
      }
    ]
  },
  {
    "weatherId": 201,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Woke up to a thunderclap? Same. The sky's clearly had enough.",
          "Rain and thunder - breakfast of champions.",
          "Bit loud out there for this early, don't you think?",
          "Umbrella? More like armour this morning."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "A cracking combo - thunder and soggy trousers.",
          "Perfect weather for cancelling plans you didn't want anyway.",
          "Bring a brolly and a stiff upper lip.",
          "Nature's throwing a tantrum - and it's not even rush hour yet."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Dinner and a light show - if you like your chips with a side of chaos.",
          "Evening stroll? Brave.",
          "It's chucking it down and throwing sparks - classic British drama.",
          "Ideal night to stay in and moan about the weather."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Sleep tight - ignore the thunder threatening your windows.",
          "Tonight's forecast: raindrops and rumbling regrets.",
          "Pitter-patter with occasional sky rage.",
          "A stormy lullaby to send you off - or keep you up."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Thunder and rain - the UK's favourite combo since tea and biscuits.",
          "It's wet, it's loud, and it's not going anywhere.",
          "Put the kettle on - the sky's clearly having a breakdown.",
          "Proper British weather - bit much, isn't it?"
        ]
      }
    ]
  },
  {
    "weatherId": 202,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Heavy rain and thunder - because your alarm wasn't rude enough.",
          "Start the day soaked and slightly alarmed - lovely.",
          "It's a 'just stay in bed' kind of morning.",
          "Sky's having a meltdown and you're invited."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Thunder, torrents, and soggy socks - delightful.",
          "It's like the sky's trying to wash us all away.",
          "Hope you brought a boat and a good attitude.",
          "Lunch plans? Only if they involve swimming."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening downpour with added drama - cheers, weather.",
          "Thunder's clapping, rain's hammering - time to panic or put the kettle on.",
          "This evening's entertainment is wet and unnecessarily loud.",
          "The perfect excuse to cancel everything and sulk indoors."
        ]
      },
      {
        "period": "night",
        "messages": [
          "If the thunder doesn't wake you, the rain will.",
          "Torrential mood from above - sweet dreams.",
          "Heavy rain at night - as calming as a freight train.",
          "Might want earplugs and a lifeboat tonight."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Thunderstorm with heavy rain - nature's least subtle mood swing.",
          "It's coming down sideways and shouting while it does.",
          "Classic British weather - just with extra volume.",
          "Proper end-of-the-world vibes out there."
        ]
      }
    ]
  },
  {
    "weatherId": 210,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Bit of thunder to go with your toast - lovely.",
          "A polite little rumble to start the day.",
          "Thunder's having a quiet grumble - relatable.",
          "Light storm, heavy sighs. Classic start."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Thunder's popped by for a quick whinge.",
          "Rain with a side of drama - very afternoon.",
          "Mild tantrum from the clouds - nothing serious.",
          "Just enough thunder to be annoying, not enough to cancel plans."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "A bit of sky rumbling to spice up your evening tea.",
          "Light thunder - loud enough to notice, quiet enough to ignore.",
          "Perfect night for a cosy moan about the weather.",
          "Just the sky making a bit of noise before bedtime."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Sleep through it? Possibly. Be mildly irritated? Definitely.",
          "Soft thunder - like the clouds are muttering insults.",
          "A gentle grumble from above to tuck you in.",
          "It's not a full-blown storm - just the sky being a bit moody."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Thunder-lite - same grump, fewer decibels.",
          "Just enough weather to be worth mentioning.",
          "Sky's mumbling again - must be British.",
          "Light thunder - like the storm can't be bothered either."
        ]
      }
    ]
  },
  {
    "weatherId": 211,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Nothing like a thunderclap to replace your alarm clock.",
          "It's loud, it's grumpy, and so are you. Good morning.",
          "Bit of thunder to go with your toast - lovely.",
          "The sky's in a strop and it's not even 9am."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Tea, biscuits, and the occasional sky rumble - delightful.",
          "Thunder's rolling in - like your emails, but louder.",
          "Great weather for muttering under your breath.",
          "Could be worse - at least it's not polite drizzle."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "The sky's making more noise than your neighbour's telly.",
          "Romantic dinner plans? Bring a helmet.",
          "That's not your stomach rumbling - it's the apocalypse preview.",
          "Evening vibes - moody, dramatic, and slightly damp."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Thunder at bedtime - just what your sleep needed.",
          "Sweet dreams between the booms.",
          "Good night, sleep tight, ignore the sky's tantrum.",
          "Sounds like the clouds are bowling again."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Thunder's about - brace for drama and damp socks.",
          "Loud, unpredictable, and inconvenient - no, not your ex.",
          "A classic British storm - bit much, bit brilliant.",
          "Keep calm and pretend you didn't flinch."
        ]
      }
    ]
  },
  {
    "weatherId": 212,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Woken up by thunder? The sky's clearly had its coffee.",
          "Heavy thunder first thing - lovely start, isn't it?",
          "Just your usual morning storm - no big deal.",
          "Rain, thunder and regret - must be morning."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "It's not just heavy - it's dramatic.",
          "Ideal weather for staying indoors and judging it from afar.",
          "Sky's putting on a show and forgot to invite the sun.",
          "That's not your stomach rumbling - it's the apocalypse preview."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening entertainment brought to you by lightning and dread.",
          "Dinner plans? Hope they include staying dry.",
          "Thunder so loud, even your nan heard it.",
          "It's not moody lighting - it's a full-on tantrum in the sky."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Good luck sleeping through that sonic boom.",
          "Rain, rumbles and existential thoughts - goodnight!",
          "Tuck in tight - the clouds are arguing again.",
          "No need for a bedtime story - the thunder's narrating."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Heavy thunderstorm - because light rain just wasn't dramatic enough.",
          "Proper storm out there - try not to look directly at it.",
          "Sky's in a full mood - again.",
          "Umbrella status: decorative at best."
        ]
      }
    ]
  },
  {
    "weatherId": 221,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Ragged thunderstorm to kick things off - lovely.",
          "Just the right amount of chaos for your commute.",
          "Bit breezy, bit boomy - just how we like our mornings dishevelled.",
          "Today's vibe - mildly electrified and completely soaked."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Rain's sideways, thunder's shouting - must be afternoon.",
          "Sky's having a full-on meltdown - bring snacks and sarcasm.",
          "Weather's doing its best 'end of the world' impression.",
          "Good luck out there - it's basically nature's tantrum."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Settle in - it's rough out and your brolly's not up for this.",
          "Even the clouds look like they've given up.",
          "Tonight's forecast: soggy socks and airborne bins.",
          "Ragged storm means dinner plans now include a mop."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Sleep well - if you can ignore the weather's rage issues.",
          "The wind's howling, the rain's horizontal - classic nightcap.",
          "If it sounds like your roof's lifting - it might be.",
          "Cuddle up. Outside's gone full drama."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Ragged storm means it's officially 'stay indoors' weather.",
          "Like a normal thunderstorm, but with more flair and less dignity.",
          "Umbrellas optional - if you enjoy suffering.",
          "British weather, but make it feral."
        ]
      }
    ]
  },
  {
    "weatherId": 230,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Thunder and drizzle - the sky's having a grumble before its coffee.",
          "A gentle reminder from the weather that umbrellas are not optional.",
          "Light drizzle with attitude - good morning indeed.",
          "A bit of thunder to spice up your soggy commute."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Rain - but make it dramatic.",
          "Just a light drizzle... with a side of theatrics.",
          "Thunder's making a scene while the drizzle sulks in the background.",
          "It's not quite a storm, but it's certainly trying."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Drizzle and drama for your evening plans - delightful.",
          "Perfect weather for staying in and judging it from the window.",
          "The sky's low-key raging - bring a brolly just in case.",
          "A bit of light chaos to go with your tea."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Soft drizzle, occasional thunder - bedtime stories by the sky.",
          "Just enough noise to make sleeping slightly inconvenient.",
          "Thunder grumbles while drizzle mopes - typical night in.",
          "Nothing like some background rumbling to lull you into anxiety."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Too wet to ignore, too lazy to be a proper storm.",
          "Thunderstorms on a budget - just a drizzle and some sound effects.",
          "A drizzle with delusions of grandeur.",
          "Mild chaos from above - just another British day, really."
        ]
      }
    ]
  },
  {
    "weatherId": 231,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Bit of thunder, bit of drizzle - just the sky being indecisive.",
          "A dramatic start to the day - wet and noisy.",
          "It's not quite a storm, not quite a mist - just enough to ruin your hair.",
          "Pop your brolly up and try not to look surprised."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Thunder with a drizzle chaser - cheers, weather.",
          "Not enough rain to cancel plans, just enough to be annoying.",
          "Loud up top, damp down below - delightful.",
          "Perfect weather for grumbling under your breath."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening drizzle with added drama - bring snacks and sarcasm.",
          "Not quite stormy, not quite soggy - just perfectly irritating.",
          "A moody sky and damp pavements - how romantic.",
          "Thunder's back with a drizzle cameo. Lovely."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Drizzle and rumblings to lull you to sleep - or not.",
          "The sky's whispering threats while dribbling on your windows.",
          "Soft rain, occasional grumbles - like a grumpy neighbour.",
          "Nighttime drizzle with attitude - typical."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Thunder and drizzle - because one weather type wasn't enough.",
          "A damp squib of a storm - British weather at its vaguest.",
          "It's doing that thing again - loud, wet, and unnecessary.",
          "Just enough thunder to be unsettling, just enough drizzle to be inconvenient."
        ]
      }
    ]
  },
  {
    "weatherId": 232,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Heavy drizzle and thunder - lovely start, really sets the tone.",
          "The sky's crying and shouting - and it's not even 9am.",
          "Hope you enjoy wet socks with your morning routine.",
          "A thunderous drizzle to gently ruin your commute."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "It's not quite a storm, not quite a shower - just deeply annoying.",
          "Perfect weather for damp jeans and questionable life choices.",
          "Thunder with drizzle - because regular rain wasn't dramatic enough.",
          "Pop out for lunch? Only if you're waterproof and brave."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Drizzle soaks you, thunder warns you - teamwork at its finest.",
          "Evening's here, and the clouds are still angry.",
          "Romantic evening ruined by soggy trousers and distant rumbling.",
          "If you thought it might clear up - it hasn't."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Heavy drizzle tapping on the windows - thunder just being rude.",
          "The perfect lullaby - soaking rain and sudden bangs.",
          "Pillow fluffed, tea made, now ignore the sky having a strop.",
          "It's dark, it's wet, and it's a bit dramatic out there."
        ]
      },
      {
        "period": "any",
        "messages": [
          "A drizzle with delusions of grandeur - now with thunder.",
          "Somewhere between a tantrum and a shower - classic British weather.",
          "Yes, it's wet. Yes, it's loud. No, it doesn't care.",
          "It's doing that thing again - rain with added theatrics."
        ]
      }
    ]
  },
  {
    "weatherId": 300,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "A gentle drizzle to remind you who's boss before 9am.",
          "Not quite rain - just enough to be annoying.",
          "Morning mist? Nope - just drizzle with commitment issues.",
          "Just wet enough to ruin your hair but not your plans."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "The sky's spitting again - how charming.",
          "Not raining, not dry - just that classic British in-between.",
          "Lunch outdoors? Bold choice in this soggy whisper.",
          "Umbrella optional, regret guaranteed."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening drizzle - nature's way of saying 'go home'.",
          "Just enough rain to make you question everything.",
          "Feels like the weather's judging your outfit choices.",
          "A moist suggestion from above - bring the brolly anyway."
        ]
      },
      {
        "period": "night",
        "messages": [
          "That faint patter? Just drizzle being indecisive again.",
          "You won't hear it, but you'll feel it on your face.",
          "Night drizzle - because the sky never clocks off.",
          "It's barely raining, but your pillow still feels damp somehow."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Drizzle - the weather equivalent of a passive-aggressive email.",
          "It's not proper rain, but you'll still arrive damp and irritable.",
          "Classic drizzle - can't commit, won't quit.",
          "Just enough moisture to ruin everything and justify nothing."
        ]
      }
    ]
  },
  {
    "weatherId": 301,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Just enough drizzle to ruin your hair and your mood.",
          "The sky couldn't commit to real rain - again.",
          "Not quite raining, just being annoying.",
          "Morning drizzle - like coffee, but wetter and far less helpful."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Too light for a brolly, too damp to ignore. Classic.",
          "That fine British drizzle - soaks you slowly, ruins you completely.",
          "It's pretending to be nothing, but your sleeves say otherwise.",
          "Just drizzle - like the weather's on a tea break."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Drizzling again - because of course it is.",
          "A gentle mist to make you question your choices.",
          "Just enough rain to look silly without a coat.",
          "That awkward drizzle stage - too early to call it a storm, too late to care."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Light drizzle tapping away - the sky's soft snore.",
          "Not heavy enough to keep you up, just irritating enough to notice.",
          "Midnight mist with no real purpose.",
          "The sort of drizzle that seeps into your soul and your socks."
        ]
      },
      {
        "period": "any",
        "messages": [
          "It's drizzling - just enough to ruin plans, not enough to justify it.",
          "You'll barely notice it until you're soaked - sneaky stuff.",
          "Too posh to pour, too rude to stop - British drizzle at its best.",
          "Like the weather's muttering under its breath - damp and disapproving."
        ]
      }
    ]
  },
  {
    "weatherId": 302,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Heavy drizzle - not quite rain, but your hair's ruined anyway.",
          "Just enough wet to ruin the vibe and your socks.",
          "The sky's having a sulk - again.",
          "Hope you like your mornings damp and slightly depressing."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Still drizzling - just harder now, like it means it.",
          "Not enough for a storm, too much to ignore - classic.",
          "Out for a stroll? Bold choice.",
          "That's not mist - it's drizzle with a grudge."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening drizzle - ruining pub gardens since forever.",
          "It's dark, it's damp, and it's determined.",
          "Perfect weather for staying in and judging the forecast.",
          "Every drop feels personal at this point."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Heavy drizzle tapping gently on your bad decisions.",
          "The sky's quietly weeping - again.",
          "Ideal night for a film and pretending it's not so grim out.",
          "Snuggle up - it's miserable out there."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Heavy drizzle - nature's way of saying 'meh'.",
          "It's not pouring, just aggressively moist.",
          "This isn't rain - it's commitment-free dampness.",
          "Somewhere between annoying and very annoying."
        ]
      }
    ]
  },
  {
    "weatherId": 310,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Just enough drizzle to ruin your hair and your mood.",
          "Light rain - heavy sigh.",
          "It's not pouring, just politely soaking everything.",
          "Morning drizzle - because the universe said no to sunshine."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Drizzle so light you won't notice it - until you're completely damp.",
          "Out for lunch? Prepare to arrive moist and mildly annoyed.",
          "This rain won't drench you - it prefers slow, soggy sabotage.",
          "Technically it's rain - emotionally it's a mild inconvenience."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "A fine drizzle to accompany your evening sulk.",
          "Not wet enough to cancel plans - just to make you hate them.",
          "A romantic misting from the sky - if you're into that.",
          "Perfect weather for watching telly and avoiding outdoors entirely."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Drizzle drifting in like an unwanted thought at bedtime.",
          "Soft patter outside - less lullaby, more damp warning.",
          "Not quite rain, not quite dry - the British in-between strikes again.",
          "Light drizzle - like the weather's whispering 'stay in bed'."
        ]
      },
      {
        "period": "any",
        "messages": [
          "The drizzle's back - as indecisive as ever.",
          "Just a bit of moisture to keep things soggy and sad.",
          "You won't see it coming - but you'll feel it in your socks.",
          "Classic British drizzle - barely there, but deeply committed."
        ]
      }
    ]
  },
  {
    "weatherId": 311,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Just enough drizzle to ruin your hair and your mood.",
          "Not quite raining, just spitting with commitment.",
          "Good morning - here's some moisture you didn't ask for.",
          "Drizzle - because a proper storm would be too decisive."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Drizzle that clings to your coat and your will to live.",
          "Barely rain - but enough to make you question going outside.",
          "A fine mist of inconvenience this afternoon.",
          "Too light for a brolly, too wet to ignore - classic."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "The kind of rain that just hangs about and ruins plans.",
          "Drizzling again - like the sky's bored and sulking.",
          "Evening walk? Sure, if you fancy a damp shuffle.",
          "A fine drizzle - nature's passive-aggressive rinse."
        ]
      },
      {
        "period": "night",
        "messages": [
          "That light drizzle tapping on the window isn't going anywhere.",
          "Just enough rain to remind you it's Britain outside.",
          "Drizzle by moonlight - oddly unsettling.",
          "Wet enough to be annoying, quiet enough to creep in."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Somewhere between a fog and a regret - it's drizzle.",
          "It's not heavy - it's just persistent and judgy.",
          "That classic British favourite - the barely-there soak.",
          "Feels like the air's crying a bit - again."
        ]
      }
    ]
  },
  {
    "weatherId": 312,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Woke up to aggressive drizzle - delightful.",
          "Drizzle with ambition this morning - bring the big brolly.",
          "It's not quite a downpour, just a very clingy mist.",
          "The weather's gone full passive-aggressive - and wet."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Heavy drizzle - just wet enough to ruin your afternoon plans.",
          "It's not dramatic, just persistently annoying.",
          "Soaks like rain, pretends it's nothing - classic British behaviour.",
          "You'll arrive everywhere looking mildly drowned."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Drizzle turned up for the evening - uninvited, of course.",
          "Perfect weather for staying in and complaining.",
          "Even the sky can't be bothered to commit to proper rain.",
          "Expect damp jeans, moody skies, and general inconvenience."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Night drizzle - soft, soggy, and silently judging you.",
          "The rain's gone into whisper mode, but your windows know.",
          "Heavy drizzle - just enough to ruin the sound of silence.",
          "Perfect night for staring at the ceiling and resenting the weather."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Drizzle, but make it intense - because of course it is.",
          "Not quite a storm, but enough to ruin your hair.",
          "Soaks your clothes and your mood - double win.",
          "The forecast says 'drizzle' - reality says 'soaking'."
        ]
      }
    ]
  },
  {
    "weatherId": 313,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Bit of drizzle, bit of rain - just enough to ruin your outfit.",
          "Not quite raining, not quite dry - fully committed to misery though.",
          "Breakfast served with a side of soggy shoes.",
          "Misty, moody, mildly annoying - morning achieved."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Showers and drizzle - a great way to test your patience.",
          "It's wet, it's pointless, and it's not stopping.",
          "Perfect weather to stare out the window and question everything.",
          "Your coat's either too much or not enough - good luck out there."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening drizzle - like rain, but with commitment issues.",
          "Damp plans and soggy socks - must be the evening forecast.",
          "It's raining just enough to ruin your walk, but not enough to stay in.",
          "Hope your dinner plans involve a towel."
        ]
      },
      {
        "period": "night",
        "messages": [
          "The kind of rain that sneaks in sideways - lovely.",
          "Bit of drizzle to lull you into a slightly damp sleep.",
          "Drip drip drip - just the sky being passive-aggressive.",
          "Sleep tight while the clouds weep gently outside."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Shower rain and drizzle - the weather equivalent of a wet handshake.",
          "Somewhere between 'meh' and 'miserable' on the weather scale.",
          "Damp. Just… damp.",
          "Bring a brolly, lower your expectations."
        ]
      }
    ]
  },
  {
    "weatherId": 314,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "A heavy drizzle to gently ruin your morning mood.",
          "It's chucking it down - hope your socks said goodbye.",
          "The sky's had a coffee and decided to cry aggressively.",
          "Rain, drizzle and despair - must be morning again."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Lunch break or swim meet? Hard to tell out there.",
          "Proper British downpour - with just a hint of spite.",
          "Rain's coming sideways now - how refreshing.",
          "The sky's version of an afternoon tantrum - wet and loud."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening plans: cancelled by drizzle with commitment issues.",
          "Romantic walk? Not unless you're into soggy feet.",
          "Still raining - because of course it is.",
          "Heavy showers to wash away what's left of your patience."
        ]
      },
      {
        "period": "night",
        "messages": [
          "The drizzle's back - now with added enthusiasm.",
          "Sleep soundtrack: relentless rain and mild regret.",
          "Snuggle in, it's a proper soakfest out there.",
          "Tonight's forecast: drizzle, then a bit more drizzle."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Not quite a storm, not quite a mist - just maximum damp.",
          "It's raining like it's got something to prove.",
          "Somewhere between a soak and a sulk - very British.",
          "Drizzle upgraded to 'why did I bother drying my hair'."
        ]
      }
    ]
  },
  {
    "weatherId": 321,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Bit of drizzle to gently ruin your morning hair.",
          "That fine rain that soaks you - and your optimism.",
          "Not quite rain, not quite dry - just perfectly irritating.",
          "Morning mist? No, just drizzle pretending to be important."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Drizzle's back - because why wouldn't it be?",
          "Too wet for comfort, too dry for sympathy.",
          "The sky's lightly weeping again - must be afternoon.",
          "Perfect weather for queueing and complaining."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening drizzle - just enough to ruin your shoes.",
          "That awkward misty nonsense is still hanging about.",
          "Out for the evening? Hope you brought your brolly - and patience.",
          "It's like the weather's undecided - but annoying about it."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Gentle drizzle tapping on the windows - how quaintly inconvenient.",
          "The kind of night where everything ends up slightly damp.",
          "Drizzling quietly so you can sleep slightly uncomfortably.",
          "Not stormy, not clear - just soggy in spirit."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Drizzle - because the UK never does anything with commitment.",
          "Light rain with strong opinions.",
          "It's barely raining, but still somehow soaking everything.",
          "That fine drizzle - sneaky, soggy, and deeply British."
        ]
      }
    ]
  },
  {
    "weatherId": 500,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Bit of light rain to wake you up - just in case the alarm didn't.",
          "Not quite a downpour, not quite dry - just inconvenient enough.",
          "Put the kettle on - it's that sort of damp morning.",
          "Ideal weather for questioning your life choices at the bus stop."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Just enough rain to ruin your hair - but not your plans.",
          "It's politely drizzling - very British of it.",
          "The sky's lightly sobbing again. Carry on.",
          "That fine rain that soaks you through - enjoy."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Light rain for your evening stroll - or your sprint to shelter.",
          "It's wet out, but only enough to be annoying.",
          "Drizzling away like the sky's got nothing better to do.",
          "You could go out - or you could respect the drizzle and stay in."
        ]
      },
      {
        "period": "night",
        "messages": [
          "A soft patter on the window - or is that just guilt for not going out?",
          "The rain's light, the mood's heavier.",
          "Perfect night for staying in and moaning about the damp.",
          "The sky's gently leaking - sleep well."
        ]
      },
      {
        "period": "any",
        "messages": [
          "It's lightly raining - just enough to ruin your socks.",
          "Somewhere between a mist and a moan.",
          "Classic British drizzle - mild, persistent, and mildly irritating.",
          "It's not much, but it's enough to grumble about."
        ]
      }
    ]
  },
  {
    "weatherId": 501,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Woke up to moderate rain - not enough to stay in, just enough to ruin your hair.",
          "It's wet out there, but not dramatically so. Just annoyingly consistent.",
          "Morning brew, soggy shoes - the British way.",
          "Bit of rain to gently dampen your mood and everything else."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Raining just enough to complain about, but not enough to cancel anything.",
          "Moderate rain - nature's way of saying 'you'll still be going out'.",
          "Hope you like lukewarm tea and damp sleeves.",
          "Raincoat on, spirits down - it's the afternoon drizzle special."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "A fine evening for staring out the window and sighing.",
          "The rain continues - like your to-do list.",
          "Bit damp out, but nothing a takeaway and denial can't fix.",
          "Evening showers - just enough to ruin nice shoes."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Soft, steady rain - ideal for sleep or existential dread.",
          "It's raining and you're indoors. Call that a small win.",
          "Perfect weather for staying in and judging it from the window.",
          "Night rain - soothing, until it leaks through the window frame."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Moderate rain - the beige of weather conditions.",
          "Not quite dramatic, not quite dry - just the British middle ground.",
          "Raining just enough to make you question your life choices.",
          "It's not a storm, it's not a mist - it's the moist middle."
        ]
      }
    ]
  },
  {
    "weatherId": 502,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Woke up? Good. Now get drenched.",
          "The rain's not messing about this morning - neither should you.",
          "Hope you like the taste of your own umbrella.",
          "Started the day soaked - it can only improve from here."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Lunch plans? Cancelled by the sky.",
          "Not just rain - it's a full-on downpour with attitude.",
          "It's that 'change clothes twice a day' kind of weather.",
          "Dry spells are for the weak - embrace the soak."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening forecast: soggy shoes and mild despair.",
          "That sound? It's your hopes of staying dry, drowned.",
          "Heavy rain - just in case the day hadn't soaked your spirit yet.",
          "Best enjoyed indoors, preferably with biscuits."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Pouring it down so you can drift off to the sound of regret.",
          "Rain hammering the windows - sleep optional.",
          "Like white noise, but wetter and more judgemental.",
          "Going out tonight? Brave. Silly, but brave."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Rain - but turned up to eleven.",
          "You didn't want to be dry anyway, did you?",
          "Not light rain, not medium rain - just 'bring a canoe' rain.",
          "Classic British weather - now in full dramatic mode."
        ]
      }
    ]
  },
{
  "weatherId": 503,
  "messages": [
    {
      "period": "morning",
      "messages": [
        "Woke up? Good. Now prepare to swim to work.",
        "It's less 'very heavy rain' - more 'build an ark'.",
        "Hope your socks weren't too attached to being dry.",
        "Lovely bit of moisture to ruin your morning optimism."
      ]
    },
    {
      "period": "afternoon",
      "messages": [
        "The kind of rain that laughs at your waterproofs.",
        "Out for lunch? Might as well just eat in the shower.",
        "Very heavy rain - because light drizzle was too subtle.",
        "You wanted dramatic skies - you got soggy despair."
      ]
    },
    {
      "period": "evening",
      "messages": [
        "Even ducks are calling it a night.",
        "Evening plans? Cancelled by deluge.",
        "It's the sort of downpour that ruins both hair and hope.",
        "Forget a jacket - you'll need a dinghy."
      ]
    },
    {
      "period": "night",
      "messages": [
        "Can't sleep? Just listen to the relentless tap dance on your window.",
        "The rain's putting on a late-night performance - no tickets required.",
        "Expect dreams to be damp - possibly flooded.",
        "It's raining sideways and somehow louder than your thoughts."
      ]
    },
    {
      "period": "any",
      "messages": [
        "Raining like the clouds have a grudge.",
        "Waterproof? Adorable. Try watertight.",
        "This isn't rain - it's a personal attack from above.",
        "Very heavy rain - as if we hadn't had enough already."
      ]
    }
  ]
},
  {
    "weatherId": 504,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Hope you packed a snorkel - it's proper biblical out there.",
          "Extreme rain to match your extreme reluctance to get up.",
          "Might want to cancel the brisk walk and build an ark instead.",
          "It's not just raining - it's aggressively auditioning for a disaster film."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Forget drizzle - this is full-on sky tantrum.",
          "You could swim home faster than drive in this.",
          "Umbrellas are laughing in the face of this nonsense.",
          "Extreme rain - because light rain just wasn't dramatic enough."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Ideal weather for staring longingly out the window and sighing.",
          "Even ducks are rethinking their life choices.",
          "Hope your dinner plans involve wellies and a canoe.",
          "It's absolutely tipping it down - might as well embrace the puddles."
        ]
      },
      {
        "period": "night",
        "messages": [
          "The soothing sound of extreme rain - and mild panic.",
          "Sleep tight while the rain tries to punch through the roof.",
          "Tonight's forecast: damp dreams and a leaky window.",
          "If you hear splashing indoors, it's probably not the bath."
        ]
      },
      {
        "period": "any",
        "messages": [
          "It's raining sideways - classic.",
          "The kind of rain that makes you question all your life choices.",
          "One does not simply 'pop out' in this weather.",
          "Bring a brolly, a backup, and maybe a wetsuit."
        ]
      }
    ]
  },
  {
    "weatherId": 511,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "It's freezing rain - like regular rain, but worse.",
          "Watch your step this morning - the pavements are plotting.",
          "Cold, wet and slippery - just what you needed to start the day.",
          "Freezing rain? Brilliant. Shall we just stay in bed?"
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Rain, but make it icy - because walking wasn't challenging enough.",
          "Nature's idea of a practical joke - and you're the punchline.",
          "Skating to the shops this afternoon, are we?",
          "Wet, cold, and a lawsuit waiting to happen."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Fancy dinner and a trip to A&E? Freezing rain says hello.",
          "Out this evening? Good luck staying upright.",
          "It's raining ice - wear every layer you own and walk like a penguin.",
          "Slick roads, slippery pavements - Britain's got talent, and it's chaos."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Night-time freezing rain - for when normal misery isn't enough.",
          "The kind of weather that makes you question your life choices.",
          "Icy rain tapping on the windows like a frosty reminder to stay put.",
          "The forecast tonight? Regret and a mild concussion if you're not careful."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Freezing rain - because slipping dramatically is a national sport.",
          "It's wet, it's cold, and it wants you on the floor.",
          "Careful out there - the pavement's gone full Bond villain.",
          "Somewhere between a weather event and a booby trap."
        ]
      }
    ]
  },
  {
    "weatherId": 520,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Light showers to gently ruin your morning hair.",
          "Not quite raining - just the sky being indecisive.",
          "A polite drizzle to ease you into the day.",
          "Feels like the weather hit snooze but still showed up damp."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "That fine rain that soaks you - and your optimism.",
          "Shower rain - nature's way of interrupting your lunch plans.",
          "Just enough rain to be annoying, not enough to justify a coat.",
          "It's the kind of rain that pretends it's no big deal. It is."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening showers - because apparently you didn't suffer enough today.",
          "Romantic walk? Only if you like being lightly misted.",
          "Just drizzle things - one soggy sleeve at a time.",
          "It's giving... 'forgot your umbrella' energy."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Soft rain tonight - like being gently judged by the weather.",
          "Drizzling just enough to keep your windows streaky.",
          "Ideal weather for lying in bed and sighing dramatically.",
          "Bit of rain, bit of gloom - lovely, really."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Light shower alert - don't worry, you'll still get soaked.",
          "It's that 'barely raining but still ruining everything' sort of weather.",
          "Rain's turned passive-aggressive again.",
          "Not full rain, just British enough to be inconvenient."
        ]
      }
    ]
  },
  {
    "weatherId": 521,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Nothing like a surprise soaking to start your day.",
          "Quick dash to the door - followed by regret and damp elbows.",
          "Morning showers - and not the nice indoor kind.",
          "It's raining again, because of course it is."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Popped out for five minutes - now you look like a drowned cat.",
          "Shower rain - because regular drizzle wasn't annoying enough.",
          "Perfect time for a spontaneous indoor hobby.",
          "Brace yourself - sky's having another sprinkle session."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Shower rain just in time to ruin your evening shoes.",
          "Nothing says 'stay in' like soggy pavements and bad lighting.",
          "Dinner and dampness - a British pairing.",
          "Evening walks now come with free surprise puddles."
        ]
      },
      {
        "period": "night",
        "messages": [
          "A gentle evening rinse - on everything you own.",
          "Soft rain falling - and louder moaning incoming.",
          "Sleep well, unless the dripping keeps you up.",
          "Even the clouds can't be bothered to commit - just on and off."
        ]
      },
      {
        "period": "any",
        "messages": [
          "It's showering - again. Try not to look shocked.",
          "Rain that comes and goes - mostly when you're outside.",
          "Just wet enough to ruin your outfit, not your plans.",
          "Umbrella roulette - will it pour or just tease?"
        ]
      }
    ]
  },
  {
    "weatherId": 522,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Woke up? Good. Now get drenched.",
          "It's not just raining - it's proving a point.",
          "Start your morning with a full-body soak - no spa required.",
          "You wanted a refreshing start - you got one, sideways."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Popped out for five minutes? Big mistake.",
          "Heavy showers - because light drizzle just wasn't dramatic enough.",
          "Everything's wet, including your patience.",
          "It's raining so hard even ducks are complaining."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening plans? Hope they involve a towel.",
          "Rain so heavy it might just knock your chips out your hands.",
          "It's the kind of rain that makes you question all your life choices.",
          "Even the clouds look exhausted from all this effort."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Sleep tight - if the downpour doesn't drum you awake.",
          "Lovely night for a swim to the shops.",
          "Rain hammering the roof - nature's white noise machine.",
          "Heavy showers at night - because why not be soaked in your dreams too?"
        ]
      },
      {
        "period": "any",
        "messages": [
          "It's coming down sideways - classic.",
          "You'll need a brolly, a coat, and probably a boat.",
          "Not a shower - more like the sky tipping a bucket.",
          "Brace yourself - this one means business."
        ]
      }
    ]
  },
  {
    "weatherId": 531,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Patchy rain and poor decisions - welcome to the morning.",
          "Bit of a drizzle ambush out there. Keep your brolly close.",
          "Some showers can't commit - this lot just sneak up on you.",
          "Rain that can't decide where it's going - much like you."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "One minute dry, next minute soaked - delightful inconsistency.",
          "Showers dropping in like uninvited guests.",
          "Your outfit was nice while it lasted.",
          "Scattered showers and scattered hope for staying dry."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening showers - now in surprise attack mode.",
          "Rain that turns up late and still ruins everything.",
          "You didn't plan for this? Neither did the clouds.",
          "Ragged rain trying its best to dampen your plans - literally."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Inconsistent rain for an inconsistent bedtime routine.",
          "A bit of drizzle to whisper you off to sleep - rudely.",
          "Don't worry - this rain has no sense of timing either.",
          "It's dark, it's wet, and it's lashing at your windows like it means it."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Shower rain that forgot how to shower properly.",
          "Patchy rain, patchy mood - coincidence?",
          "It's wet. Then it's not. Then it is again.",
          "The forecast? Utterly unreliable - just like the rain."
        ]
      }
    ]
  },
  {
    "weatherId": 600,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "A gentle dusting of snow - or as we call it, nationwide panic.",
          "Snowflakes in your cereal? Must be morning.",
          "Light snow - but heavy enough to delay absolutely everything.",
          "Ah, nothing like frozen pavements to kickstart your day."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Still snowing - still pretending it's a winter wonderland.",
          "Light snow - just enough to ruin your shoes.",
          "That awkward phase where it's not quite snowman-worthy, but still annoying.",
          "White bits falling from the sky - don't act surprised."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Snow's settling in for the evening - unlike your dinner plans.",
          "A light flurry to match your mood.",
          "Snow falling softly - like all your motivation to go out.",
          "Evening walks now include sliding with style."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Snowy dreams incoming - unless the boiler packs it in.",
          "Tuck in tight - the flakes are plotting.",
          "Tonight's vibe: frosty outside, frosty inside.",
          "Snow's still coming down - quietly judging your heating bill."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Light snow - cue the mass hysteria.",
          "Snow on the ground, chaos in the air.",
          "It's snowing - so naturally, everything's cancelled.",
          "A scenic nuisance, falling gently from the sky."
        ]
      }
    ]
  },
  {
    "weatherId": 601,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Woke up to snow - time to panic and buy bread.",
          "Bit of snow and the whole country forgets how roads work.",
          "Snow in the morning? Cancel everything and make tea.",
          "White stuff on the ground - proceed with exaggerated caution."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Snow's still here - shocking, really.",
          "Afternoon flurries - pretty until you have to walk in them.",
          "It's all fun and games until it turns to slush.",
          "Snowball fight? More like a slipping hazard in disguise."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Snowy evenings - lovely from inside, tragic from a bus stop.",
          "Dinner plans? Not in this weather.",
          "Cold, slippery and inconvenient - must be snowing.",
          "Cosy night in? Good choice. The snow agrees."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Snow at night - romantic in theory, freezing in practice.",
          "Tiptoe through the snowdrifts like it's a festive crime scene.",
          "Midnight frostbite, anyone?",
          "The snow is settling - unlike your sleep schedule."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Snow - because the rain wasn't dramatic enough.",
          "It's cold, it's white, and it's out to ruin your plans.",
          "Snow: nature's way of saying 'not today'.",
          "Lovely to look at - awful to commute in. Classic."
        ]
      }
    ]
  },
  {
    "weatherId": 602,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "It's snow joke out there this morning.",
          "Woke up to Narnia - without the talking lion or central heating.",
          "Snow on the ground and tea in hand - carry on.",
          "Put on everything you own - it's that kind of morning."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Still snowing. Still not skiing. Still not fun.",
          "Heavy snow - great for photos, terrible for everything else.",
          "It's all fun and games until your toes go numb.",
          "Hope you like walking like a penguin - you've got no choice."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "It's a winter wonderland - if you ignore the slush and despair.",
          "Perfect night for staying in and judging the snow from a distance.",
          "Snow's still falling - unlike your motivation to go outside.",
          "Heavy flakes, cold cheeks, and no chance of takeaway delivery."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Tucked in while the snow does its worst - well played.",
          "Outside's a freezer - inside's a victory.",
          "Heavy snow tonight - dreams of summer encouraged.",
          "Falling snow, rising duvet - balance restored."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Heavy snow - looks pretty, feels awful.",
          "Bundle up - it's a proper snowpocalypse out there.",
          "Snow is falling - chaos is calling.",
          "The snow's not messing about - hope you brought snacks."
        ]
      }
    ]
  },
  {
    "weatherId": 611,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Ah, sleet - the weather that can't make its mind up.",
          "Cold, wet, and slightly aggressive. Good morning to you too.",
          "Sleet on the menu - hope you brought your skates and a snorkel.",
          "Ideal weather for staying in bed. Shame about responsibilities."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "It's sleeting. Not snow, not rain - just disappointment.",
          "The sky's indecisive and now your shoes are soaked.",
          "Pop out for lunch? Brave choice in this slushy nonsense.",
          "Half snow, half rain - all misery."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening sleet - because regular rain wasn't dramatic enough.",
          "It's like the sky gave up halfway through snowing.",
          "Perfect weather for regretting every clothing choice.",
          "Wrap up warm - and waterproof. And maybe wear a helmet."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Sleet tonight - the worst of both worlds while you try to sleep.",
          "Wet and cold - a bedtime story by British weather.",
          "Hope your windows are shut. It's getting spiteful out there.",
          "Settle in, it's a slushy one. Ideal for hot drinks and complaints."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Sleet - nature's way of saying 'no' to your plans.",
          "Not quite snow, not quite rain - fully inconvenient.",
          "Soggy and cold with a chance of slipping. Lovely.",
          "Bring an umbrella, wear boots, and lower your expectations."
        ]
      }
    ]
  },
  {
    "weatherId": 612,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "It's sleeting - because rain wasn't miserable enough on its own.",
          "A gentle reminder this morning that the weather hates you.",
          "Cold, wet, and vaguely icy - lovely start, really.",
          "Is it rain? Is it snow? No one knows. But it's definitely annoying."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Bit of sleet to spice up your afternoon doom-scroll.",
          "Light sleet - the weather equivalent of a passive-aggressive post-it note.",
          "Damp, cold, and a bit confused - like most of us by 3pm.",
          "Not quite snow, not quite rain - just unpleasant enough to complain about."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening plans? Bring a coat and lowered expectations.",
          "Sleet in the evening - because your commute wasn't soul-crushing enough.",
          "A perfect night for staying in and judging the weather from the window.",
          "Light sleet falling, as if the day needed a final kick in the shins."
        ]
      },
      {
        "period": "night",
        "messages": [
          "The kind of night where sleet taps the window like it wants in.",
          "Bundle up - it's wet, it's cold, and it's plotting.",
          "Tonight's vibe: soggy but slightly crunchy.",
          "Sleep tight, but maybe add an extra blanket. And a small boat."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Sleet - nature's least committed weather.",
          "That fine British sleet - all the joy of winter, none of the charm.",
          "Just enough ice to slip, just enough rain to ruin your shoes.",
          "A bit of sleet to keep you humble."
        ]
      }
    ]
  },
  {
    "weatherId": 613,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Bit of rain, bit of snow - all before breakfast.",
          "Sleet in the morning? Someone upstairs is having a laugh.",
          "The sky couldn't decide - so it sent both.",
          "Not quite snow, not quite rain - just fully annoying."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Afternoon sleet - like rain, but colder and more spiteful.",
          "A solid reminder you live in Britain and not a postcard.",
          "Bring a coat, bring patience, and maybe a boat.",
          "Nothing says 'good vibes' like wet socks and sleet."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "An evening sprinkle of sleet - because drizzle wasn't grim enough.",
          "It's wet, it's cold, and it's still sleet - good luck out there.",
          "Perfect night for staying in and pretending you didn't see the forecast.",
          "Evening plans meet icy betrayal from above."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Night sleet - when the weather bullies you in your pyjamas.",
          "It's cold, slushy, and falling from the sky. Sleep well.",
          "A symphony of sleet tapping at the window - delightful.",
          "Weather says no to comfort tonight."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Sleet - for when you want the worst of both worlds.",
          "Not quite snow, not quite rain - but still thoroughly miserable.",
          "Just enough to soak you and chill your bones. Cheers, sleet.",
          "It's sleeting - because plain old rain was too easy."
        ]
      }
    ]
  },
  {
    "weatherId": 615,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Rain and snow to start your day - the weather's confused and so are we.",
          "Is it winter? Is it spring? Who knows - bring everything.",
          "A bit of snow, a bit of drizzle - like cereal with cold tea.",
          "Just enough slush to ruin your shoes before breakfast."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Too wet for snow, too cold for rain - classic British compromise.",
          "Rain and snow - nature's way of saying 'don't bother'.",
          "Hope you wore waterproofs and low expectations.",
          "Somewhere between a snowman and a puddle lies your afternoon."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening plans? Just try not to slip or soak.",
          "It's the kind of weather that ruins both hair and hope.",
          "Bit of snow, bit of rain - zero chance of a pleasant evening.",
          "Perfect conditions for staying home and questioning your life choices."
        ]
      },
      {
        "period": "night",
        "messages": [
          "The sound of light sleet tapping your window - romantically grim.",
          "Snuggle up - it's damp, cold, and deeply British out there.",
          "Snowy drizzle dreams await. Or nightmares.",
          "Tonight's forecast: part rain, part snow, all nuisance."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Rain and snow - because one kind of misery wasn't enough.",
          "Weather's having an identity crisis again.",
          "It's wet. It's cold. It's definitely not ideal.",
          "A drizzle with a dusting - like a soggy mince pie."
        ]
      }
    ]
  },
  {
    "weatherId": 616,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Rain and snow this morning - because one misery wasn't enough.",
          "Woke up to a weather identity crisis. Is it winter? Is it wet? Yes.",
          "A soggy flurry to start the day. Lovely.",
          "It's snowing and raining - the sky clearly skipped breakfast."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Rain meets snow in a damp handshake. Bring a mop.",
          "Make up your mind, weather - sleet isn't a personality.",
          "Half snow, half rain - full disappointment.",
          "Perfect for ruining shoes and moods alike."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening forecast: part ice, part puddle, all nuisance.",
          "Not cold enough to be pretty, not warm enough to ignore. Cheers, weather.",
          "Dinner plans? Hope they include wellies.",
          "Raining, snowing, and still somehow grey. Bravo."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Rain and snow tonight - ideal for staying in and judging it from the window.",
          "If you hear slush noises in the dark, don't panic - it's just the weather sulking.",
          "Sleep through the chaos - or lie awake wondering why it's so wet and cold.",
          "Outside: misery. Inside: slightly warmer misery."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Not quite rain, not quite snow - just perfectly unpleasant.",
          "This weather's doing a bit of everything - badly.",
          "One of those 'wear everything you own' kind of days.",
          "Slippery, soggy, and somehow still snowing sideways."
        ]
      }
    ]
  },
  {
    "weatherId": 620,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Bit of snow to start your day - because coffee wasn't enough of a jolt.",
          "It's snowing - lightly, but annoyingly.",
          "Brisk walk to work? More like icy shuffle of doom.",
          "Tiny snowflakes pretending they matter - classic morning drama."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Light snow - just enough to be inconvenient, not magical.",
          "A gentle flurry - like the weather's trying to be cute.",
          "Snow showers and soggy shoes incoming.",
          "Perfect time to regret your choice of footwear."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Snow's back - just in time to ruin your evening plans.",
          "Evening chill with a sprinkle of slush - lovely.",
          "A flurry here, a grumble there - proper British night out.",
          "It's snowing again. No one asked for this."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Light snow falling - and so are your chances of staying warm.",
          "Frosty outside, warm cuppa inside - choose wisely.",
          "Snowy whispers from the sky - romantic or just cold?",
          "Flakes falling while you sleep - or try to under three blankets."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Light snow - nature's way of saying 'deal with it'.",
          "It's snowing, but not enough to be exciting - just wet and smug.",
          "Snow showers - festive in theory, slushy in reality.",
          "Snowflakes again? Groundbreaking."
        ]
      }
    ]
  },
  {
    "weatherId": 621,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Woke up to snow flurries - it's like nature hit snooze on winter.",
          "Bit of snow this morning - not enough to cancel life, sadly.",
          "Snow showers - because rain wasn't miserable enough.",
          "It's that charming mix of cold toes and false hope."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Snow's having a quick flirt with the pavement.",
          "It's snowing - but not the fun, build-a-snowman kind.",
          "Cold, wet, and fleeting - like British enthusiasm.",
          "Snow showers - just enough to ruin your shoes, not your plans."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening snow flurries - looks lovely, feels like betrayal.",
          "That's not magic in the air - it's slush on your coat.",
          "Cosy evening? Not if you've got to be outside in this nonsense.",
          "Snow showers making sure you regret not wearing thicker socks."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Night-time snow - silently judging your heating bill.",
          "Sleep well while the snow tries to ruin tomorrow.",
          "Outside: flurries. Inside: five blankets and a mild panic.",
          "It's snowing again - because your toes weren't numb enough."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Shower snow - nature can't commit to proper snowfall.",
          "Just enough snow to look festive, not enough to be useful.",
          "Cold, flaky, and fleeting - sounds familiar, doesn't it?",
          "Snow showers - somewhere between 'aww' and 'ugh'."
        ]
      }
    ]
  },
  {
    "weatherId": 622,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Woke up to a blizzard tantrum - marvellous.",
          "Heavy snow showers - just what you needed with your toast.",
          "It's snowing sideways and you've got socks for gloves. Good luck.",
          "The sky's gone full snow drama. You're not going anywhere fast."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Hope you brought skis - or at least something vaguely waterproof.",
          "Snow's coming down like it's got something to prove.",
          "It's snowing heavily and so is the sarcasm.",
          "Out for lunch? Bring a sled and a strong sense of denial."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "The snow's still at it - someone upset the clouds again.",
          "Perfect evening for staying in and judging the forecast.",
          "Heavy snow showers - ideal for cancelling everything with zero guilt.",
          "Cosy evening in? More like snow survival mode."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Snow's still showing off - time to hibernate.",
          "Tuck in tight - it's a snow globe out there.",
          "The world's gone frosty and so has your duvet.",
          "Heavy snow and bedtime? Sweet dreams, snow warrior."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Snow's falling hard - like British optimism in April.",
          "It's a blizzard out there - again. Shocker.",
          "Snow showers with attitude. So British, it hurts.",
          "Think of it as nature's way of forcing a duvet day."
        ]
      }
    ]
  },
  {
    "weatherId": 701,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Misty start - great for dramatic stares into the distance.",
          "You're not late - the fog just slowed time down.",
          "It's not just you - the world really is a bit blurry this morning.",
          "Perfect weather for pretending you're in a mystery novel."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Still misty - either that or your glasses need a wipe.",
          "Sun's trying its best, but the mist's winning.",
          "Visibility: questionable. Mood: confused but British.",
          "Some call it atmospheric - others just call it annoying."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening mist - the weather's way of setting the mood.",
          "That hazy look outside? Not your eyesight - yet.",
          "Low visibility, high chance of wandering into the wrong pub.",
          "Perfect evening for getting lost in your own street."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Mist at night - because walking into lamp posts wasn't hard enough.",
          "The fog's rolled in for bedtime storytelling vibes.",
          "Can't see much, but you're not missing anything exciting.",
          "Thick mist and darkness - what could possibly go wrong?"
        ]
      },
      {
        "period": "any",
        "messages": [
          "Misty out there - like the weather's trying to be mysterious.",
          "If it looks like a dream sequence, blame the mist.",
          "British weather update: the sky's lost its clarity again.",
          "That eerie silence? Just mist doing its thing."
        ]
      }
    ]
  },
  {
    "weatherId": 711,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Bit hazy this morning - either smoke or you're still half asleep.",
          "Smells like someone burnt the toast on a national scale.",
          "The sun's up there somewhere - good luck finding it.",
          "It's a smoky start - maybe hold off on the jog, yeah?"
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Visibility: questionable. Style: impeccable (hopefully).",
          "That's not fog - it's just the sky having a ciggie break.",
          "Smoky out there - maybe skip pretending to enjoy the fresh air.",
          "Not the vibe for an al fresco lunch, unless you fancy it smoked."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Bit murky out there - perfect for dramatic stares into the distance.",
          "Evening's got that 'mystery novel' filter on - very moody.",
          "Smoke and sunsets don't mix well - unless you like squinting.",
          "If you can't see the stars tonight, blame the air not your eyesight."
        ]
      },
      {
        "period": "night",
        "messages": [
          "A smoky night - like someone left the barbecue on and legged it.",
          "Sleep tight - don't let the haze bite.",
          "Nighttime noir vibes - all we need now is dramatic jazz.",
          "Can't see the moon? It's not shy - just smoked out."
        ]
      },
      {
        "period": "any",
        "messages": [
          "It's not fog - it's smoke. Slightly less romantic, slightly more wheezy.",
          "The sky's gone full filter - no editing needed.",
          "Air quality's taking a little holiday - maybe you should too.",
          "It's giving 'Victorian London' - minus the top hats."
        ]
      }
    ]
  },
  {
    "weatherId": 721,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Bit foggy out - like your brain before the first cuppa.",
          "Everything's a bit blurry - and not just your outlook.",
          "Morning haze - because the weather's as groggy as you are.",
          "Visibility's low, mood's lower."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Hazy views and questionable decisions await.",
          "Sun's trying its best - bless it.",
          "Like sunglasses for the sky - without the glamour.",
          "Outlook unclear - just like your lunch plans."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Romantic haze or just pollution? You decide.",
          "A bit misty out - perfect for dramatic stares into the distance.",
          "The sky's gone soft focus - must be feeling artsy.",
          "Evening's rolled in with a filter on."
        ]
      },
      {
        "period": "night",
        "messages": [
          "The haze is hanging around like an uninvited guest.",
          "Sleepy skies with a hint of confusion.",
          "You can't see much - perfect for ignoring your to-do list.",
          "It's all a bit murky out - like a mystery novel, but damp."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Hazy with a chance of squinting.",
          "Air's gone all mysterious - again.",
          "Can't tell if it's weather or just bad lighting.",
          "It's not fog, it's 'atmosphere' - apparently."
        ]
      }
    ]
  },
  {
    "weatherId": 731,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Dust in the air and toast crumbs in your tea - cracking start.",
          "Wake up and smell the... sand? Brilliant.",
          "Lovely bit of texture in the morning breeze - mostly grit.",
          "Hair's got more volume today - thanks to airborne earth."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "It's not fog - it's flavour. Dust flavour.",
          "Eyes watering? That's just nature's exfoliation.",
          "Bring sunglasses - not for the sun, just to dodge the dust.",
          "Sand in your sandwich - gourmet."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "A fine layer of grit over everything - how delightful.",
          "Romantic evening breeze - now with extra sediment.",
          "Dust whirls and drama - and that's just the weather.",
          "Skip the perfume - you'll be wearing 'Eau de Sahara'."
        ]
      },
      {
        "period": "night",
        "messages": [
          "That crunch in your teeth? Not dinner.",
          "Dusty dreams incoming - maybe close the window.",
          "Sleep tight - try not to inhale the landscape.",
          "The air's got texture tonight - who needs clean lungs anyway?"
        ]
      },
      {
        "period": "any",
        "messages": [
          "It's not foggy - it's just the Earth trying to get in your eyes.",
          "Sand in the air - and you thought rain was annoying.",
          "A bit blowy with a chance of facial sandblasting.",
          "Warning - may cause sudden impersonations of a sand dune."
        ]
      }
    ]
  },
  {
    "weatherId": 741,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Misty start - just like your motivation.",
          "Can't see a thing out there. Best stay in and make toast.",
          "The fog's rolled in - probably lost, like the rest of us.",
          "If you squint, you still can't see anything. Classic morning."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Afternoon fog - because grey wasn't dreary enough already.",
          "It's not mysterious, it's just inconvenient.",
          "Good luck finding your way. The fog certainly hasn't.",
          "Perfect weather for wandering aimlessly with purpose."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "A foggy evening - great for dramatic exits you can't see.",
          "Romantic mist or just damp air and missed buses? You decide.",
          "Out for dinner? Hope you packed sonar.",
          "Visibility: poor. Vibes: also poor."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Tonight's forecast: fog and frustration.",
          "Even the moon's called it a night - can't see it anyway.",
          "Sleep tight - not that you'll spot the stars through that pea soup.",
          "If it gets any foggier, we'll need lighthouses on lampposts."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Fog - because apparently weather should also be confusing.",
          "The world's still out there, probably.",
          "Damp, dull, and disoriented - must be fog again.",
          "If you wanted clarity, you picked the wrong forecast."
        ]
      }
    ]
  },
  {
    "weatherId": 751,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Ah, nothing says good morning like sand in your cereal.",
          "Start the day with a fresh coat of grit on everything you own.",
          "It's not fog - it's sand. Welcome to the world's least fun beach.",
          "Breathe in deep - just kidding, maybe keep the windows shut."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Sun, sand, and absolutely no sea in sight.",
          "Feels like a beach holiday - minus the joy and cocktails.",
          "The only thing drifting in this afternoon is dust.",
          "Sand in the air, and probably in your sandwich too."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Golden hour - if you count airborne sand as 'golden'.",
          "Dimming light and rising dust - what a treat.",
          "Evening breeze? More like a faceful of grit.",
          "Lovely evening for exfoliating your eyeballs."
        ]
      },
      {
        "period": "night",
        "messages": [
          "The stars are out - behind a fine layer of airborne gravel.",
          "Night-time forecast: mostly sandy with a chance of sneezing.",
          "Tuck in tight - the sand's on the move.",
          "Hope you like your dreams a bit dusty."
        ]
      },
      {
        "period": "any",
        "messages": [
          "There's sand in the air - and probably in places you'll discover later.",
          "It's gritty out - literally and emotionally.",
          "Some call it exotic. We call it annoying.",
          "British weather's gone all desert chic - stylish, but impractical."
        ]
      }
    ]
  },
  {
    "weatherId": 761,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Start your day with a fine layer of dust - who needs skincare?",
          "Dust in the air and regret in your lungs.",
          "Lovely morning for a light coating of grit.",
          "Hope you weren't planning to breathe deeply today."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Dusty out there - ideal weather for indoor sulking.",
          "Perfect time for a brisk walk - straight back inside.",
          "It's like nature's sprinkling seasoning - just not on food.",
          "Feeling parched? That's the dust. Or existential dread."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "That golden glow? Yeah - it's dust, not romance.",
          "Evening breeze with a hint of desert vibes and poor visibility.",
          "Dusty dinner alfresco? Don't chew too hard.",
          "A scenic evening ruined by airborne earth. Classic."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Dust settling in for the night - unlike you.",
          "Sleep tight - if you can find a clean pillow.",
          "Air so dry it's practically vintage.",
          "Tonight's forecast: low visibility and higher levels of sighing."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Dust in the air - just what your lungs ordered.",
          "Bit gritty out there - like British humour.",
          "Less weather, more atmospheric complaint.",
          "Feels like the house needs a hoover - and so do you."
        ]
      }
    ]
  },
  {
    "weatherId": 762,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Volcanic ash this morning - as if waking up wasn't hard enough.",
          "Ash in the air and no volcano in sight - typical.",
          "Toast smells funny? Might not be the toaster this time.",
          "Volcanic vibes without the holiday - brilliant."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Pop out for lunch and come back dusted like a Victorian mantelpiece.",
          "Volcanic ash - because regular weather just wasn't dramatic enough.",
          "Sky's gone full goth this afternoon.",
          "Not fog - just a casual reminder the Earth's crust is moody."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Evening plans? Ash them.",
          "The only thing erupting tonight is your patience.",
          "Ashy skies and no marshmallows in sight - tragic.",
          "Perfect night for staying in and googling 'is this normal?'"
        ]
      },
      {
        "period": "night",
        "messages": [
          "Sleep well - try not to breathe too deeply.",
          "Volcanic ash at night? That's oddly specific, even for us.",
          "Air's thick enough to slice - sweet dreams.",
          "Tonight's vibe: dusty with a chance of apocalypse."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Volcanic ash, apparently. Britain just trying new plot twists now.",
          "Sky looks like it's been through a chimney - and so will you.",
          "It's not pollution, it's personality.",
          "Ash falling from above - must be one of those 'once in a generation' days."
        ]
      }
    ]
  },
  {
    "weatherId": 771,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Bit breezy out - hold onto your toast and your dignity.",
          "Morning squalls - because getting out of bed wasn't hard enough.",
          "Windy with a chance of chasing your brolly down the street.",
          "Air's moving faster than you are - good luck out there."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Wind's picked up - so has your hairline.",
          "Great day for pretending you're in a wind tunnel advert.",
          "It's less a breeze, more a full-body shove.",
          "Out for lunch? Might fly there at this rate."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "That's not ambience - that's your bins doing a runner.",
          "Windy evening ahead - might want to tether your trousers.",
          "Going out? Best dress like a kite and hope for the best.",
          "The wind's howling - probably gossiping about your outfit."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Sleep tight - the wind sure won't.",
          "Squalls at night - for when silence is just too boring.",
          "Sounds like the roof's thinking about leaving.",
          "That gentle creaking? Just your house arguing with the wind."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Squalls - the weather's way of keeping you humble.",
          "Brace yourself - and maybe the shed too.",
          "Windy enough to dry your laundry while it's still on you.",
          "Your umbrella won't help - but bring it anyway, for morale."
        ]
      }
    ]
  },
  {
    "weatherId": 781,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Well that escalated quickly - fancy a flying start to the day?",
          "Tornado this morning - might be a good excuse to skip the commute.",
          "Breezy, with a chance of spontaneous relocation.",
          "Might want to rethink that hairdo - unless windswept is your thing."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Afternoon forecast: mild chaos with strong furniture displacement.",
          "Tornado on the cards - try not to get blown into next week.",
          "Best stay indoors unless you fancy becoming airborne.",
          "Not your average blustery afternoon - hold onto your hat and your house."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Dinner plans may be cancelled due to excessive twirling buildings.",
          "Evening entertainment provided by nature's spin cycle.",
          "It's windy. Not 'lost your brolly' windy - more 'lost your roof' windy.",
          "Maybe give the pub garden a miss tonight."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Sleep tight - and maybe tie down the shed.",
          "Tornado tonight - perfect weather for staying in your storm bunker.",
          "If you wake up in a different postcode, blame the wind.",
          "Tonight's forecast is... dramatic."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Tornado, eh? Bit more exciting than drizzle, I suppose.",
          "Brolly won't help here - you'll need an anchor.",
          "Wind's picked up a bit - by which we mean it's carrying trees.",
          "Proper British breeze - if Britain were in Kansas."
        ]
      }
    ]
  },
  {
    "weatherId": 800,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Clear skies this morning - someone must've paid extra.",
          "The sun's up and showing off - must be feeling brave.",
          "Morning sunshine and no gloom? What's the catch?",
          "Sky's clear and blue - the British crisis response team is on standby.",
          "A bright start to the day - suspicious, but we'll allow it.",
          "The sun's early today - clearly didn't get the British memo.",
          "Zero clouds, full confusion - we're not built for this.",
          "It's officially morning and miraculously dry - alert the authorities."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Sunshine and no clouds - has someone filed a complaint yet?",
          "Afternoon glow with no gloom - must be a clerical error.",
          "The sky's doing its best holiday impression - enjoy it while it lasts.",
          "Not a cloud in sight and only mild existential dread - result.",
          "An afternoon so clear, it feels like we're abroad.",
          "Sun's out, confidence up, awkward tan lines pending.",
          "The weather's being overly nice - we're not falling for it.",
          "Blue skies overhead - perfect for pretending everything's fine."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Clear evening skies - almost enough to make you leave the house.",
          "Sunset's looking smug tonight - and honestly, fair enough.",
          "Sky's still showing off - it's got stamina, we'll give it that.",
          "Golden hour's doing its best impression of optimism.",
          "Not a single cloud as the sun clocks out - suspiciously efficient.",
          "The evening's clear, calm, and deeply unsettling for Brits.",
          "Feels like the kind of evening where nothing goes wrong - yet.",
          "You can actually see the sky - we're through the looking glass now."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Stars are out and the clouds have called in sick - for now.",
          "A rare clear night - even the moon looks surprised.",
          "Perfect night for stargazing and pretending you know constellations.",
          "The sky's giving peace and quiet - unlike your neighbours.",
          "Clear skies at night - it's giving 'British holiday optimism'.",
          "No clouds, no drama, just moonlight and mild anxiety.",
          "A sky this clear must've come from the European forecast.",
          "Even the weather's gone quiet - makes a nice change, doesn't it?"
        ]
      },
      {
        "period": "any",
        "messages": [
          "Clear skies all round - it's making us nervous, frankly.",
          "The weather's having a rare moment of clarity - enjoy the silence.",
          "No rain, no clouds - we're not sure how to dress for this.",
          "Blue skies in the UK? Don't panic, but something's up.",
          "It's the kind of weather that makes you forget where you are.",
          "Sun's out and the sarcasm's on hold - temporarily.",
          "The sky's behaving better than most politicians.",
          "A clear sky in Britain - sounds made up, but here we are."
        ]
      }
    ]
  },
  {
    "weatherId": 801,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Just a few clouds about - almost suspiciously pleasant.",
          "A rare sight - the sun peeking out without needing a formal invitation.",
          "Start the day with mild optimism and mild cloud cover.",
          "Morning sky's playing nice - don't trust it for long."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "A few clouds loitering - probably up to no good.",
          "Sky's mostly clear - which feels like a trap.",
          "Sun's out with just enough cloud to keep you guessing.",
          "That awkward phase where it's not quite sunny but you feel overdressed."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Just enough clouds to ruin your sunset photo.",
          "A polite scattering of fluff in the sky - very British.",
          "Evening looking decent - which is frankly unnerving.",
          "Bit of cloud, bit of light, bit of 'is it coat weather?' confusion."
        ]
      },
      {
        "period": "night",
        "messages": [
          "A few clouds up there - probably gossiping about us.",
          "Not enough cloud to be cosy, not enough stars to be romantic.",
          "Night's mostly clear - time to stare into the void, British style.",
          "Just enough cloud to block the one star you were trying to see."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Some clouds about - like uninvited guests who won't cause trouble.",
          "Sky's feeling half-committed today.",
          "Not quite sunny, not quite moody - classic British indecision.",
          "Clouds just doing their thing - loitering with light intent."
        ]
      }
    ]
  },
  {
    "weatherId": 802,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Bit of cloud about - like the weather couldn't quite commit.",
          "Sun's playing peekaboo - classic morning mood.",
          "Not grey, not blue - just indecisive.",
          "Scattered clouds and scattered thoughts - good luck out there."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "Half sunny, half cloudy - like the weather couldn't be bothered to choose.",
          "Clouds are about - not enough for drama, just enough to block the view.",
          "Some sun, some cloud - a diplomatic forecast.",
          "The sun's negotiating terms with the clouds. No winner yet."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Scattered clouds rolling in - even the sky's not sure what it wants.",
          "That's not a dramatic sunset - it's a sky stuck in a group chat.",
          "Half the sky's calling it a night. The other half's loitering.",
          "Evening skies doing their best impression of 'meh'."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Bit of cloud cover to keep the stars humble.",
          "Scattered clouds - not spooky, just mildly inconvenient.",
          "Not quite clear, not quite dramatic - just politely overcast.",
          "Some clouds lingering - like they've missed their curfew."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Scattered clouds - because a fully clear sky would be showing off.",
          "Not enough cloud for concern - just enough for commentary.",
          "It's the weather equivalent of 'yeah, it's fine'.",
          "Clouds scattered like your plans - a bit here, a bit there."
        ]
      }
    ]
  },
  {
    "weatherId": 803,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "A few gaps in the clouds - just enough to tease you.",
          "Bit of sun playing peekaboo - don't get your hopes up.",
          "The sky's undecided - like you before your first cuppa.",
          "Cloudy, but not committed - just like your morning motivation."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "The sun's trying its best - bless it.",
          "Half the sky's on break - typical.",
          "Broken clouds. Looks a bit grey, doesn't it?",
          "Some clouds have cleared - the rest couldn't be bothered."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "A few clouds lingering like uninvited guests.",
          "It's not gloomy - just moody.",
          "The sky's doing that 'mildly dramatic' thing again.",
          "Bit of cloud, bit of clear - it's all very non-committal."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Clouds doing a half-job - must be bedtime.",
          "Stars? Maybe. Depends if the clouds are feeling generous.",
          "Partly cloudy, fully annoying.",
          "Even the clouds are winding down for the night."
        ]
      },
      {
        "period": "any",
        "messages": [
          "Broken clouds - like British promises of summer.",
          "Bit cloudy, bit clear - classic fence-sitting weather.",
          "Not quite overcast, not quite sunny - delightfully average.",
          "Sky's got commitment issues again."
        ]
      }
    ]
  },
  {
    "weatherId": 804,
    "messages": [
      {
        "period": "morning",
        "messages": [
          "Good morning - if you can call it that through this blanket of grey.",
          "Sun's having a lie-in. Again.",
          "Perfect light for existential dread and instant coffee.",
          "Overcast skies - just what we needed to feel truly awake."
        ]
      },
      {
        "period": "afternoon",
        "messages": [
          "The sun applied for annual leave - and it got approved.",
          "It's bright grey out. Classic.",
          "Not raining, but not exactly inspiring either.",
          "Lunch break views - 50 shades of meh."
        ]
      },
      {
        "period": "evening",
        "messages": [
          "Dull outside, just like your evening plans.",
          "The sky's gone full cardigan - flat, grey and vaguely disappointed.",
          "Overcast with a chance of staying in.",
          "Romantic sunset? Not today, pal."
        ]
      },
      {
        "period": "night",
        "messages": [
          "Clouds so thick, even the moon's given up.",
          "Starry night? More like murky gloom.",
          "Sky's tucked itself in - shame you can't see it.",
          "Dark, cloudy, and just a bit moody - sounds familiar."
        ]
      },
      {
        "period": "any",
        "messages": [
          "The sky's gone full duvet - overcast and not moving.",
          "It's not raining, but it's thinking about it.",
          "That grey ceiling's not budging anytime soon.",
          "Classic British weather - aggressively average."
        ]
      }
    ]
  }
]